Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <comment>(Общ)</comment>
  <basedOn>Catalog.Организации</basedOn>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительноеОписание</name>
    <comment>(Общ) Дополнительное описание</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнойКонтрагент</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникИнформацииПриОбращении</name>
    <comment>(Упр)</comment>
    <type>
      <types>CatalogRef.ИсточникиИнформацииПриОбращенииПокупателей</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <comment>(Регл) </comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <comment>(Регл) Идентификационный номер налогоплательщика</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <comment>(Регл) Код причины постановки на учет</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ЮрФизЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойБанковскийСчет</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойДоговорКонтрагента</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойВидДеятельности</name>
    <comment>(Упр)</comment>
    <type>
      <types>CatalogRef.ВидыДеятельностиКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументУдостоверяющийЛичность</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойМенеджерПокупателя</name>
    <comment>(Упр) Основной менеджер</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасписаниеРаботыСтрокой</name>
    <comment>(Общ) Расписание работы строкой</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокВыполненияЗаказаПоставщиком</name>
    <comment>(Упр)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеКонтактноеЛицо</name>
    <comment>(Упр)</comment>
    <type>
      <types>CatalogRef.КонтактныеЛицаКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>НеЯвляетсяРезидентом</name>
    <comment>(Регл)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОКОПФ</name>
    <type>
      <types>CatalogRef.КлассификаторОКОПФ</types>
    </type>
  </attributes>
  <attributes>
    <name>Регион</name>
    <type>
      <types>CatalogRef.Регионы</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДоступаКонтрагента</name>
    <type>
      <types>CatalogRef.ГруппыДоступаКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_GLN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_СтатусКонтрагента</name>
    <type>
      <types>EnumRef.абс_СтатусыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ОсновнойСпособДоставки</name>
    <type>
      <types>CatalogRef.абс_СпособыДоставкиКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ВходитВХолдинг</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Холдинг</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_Предшественник</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_НаименованиеИностранное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Отдел</name>
    <type>
      <types>CatalogRef.Регионы</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_БизнесРегион</name>
    <type>
      <types>CatalogRef.Регионы</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Территория</name>
    <type>
      <types>CatalogRef.Регионы</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Город</name>
    <type>
      <types>CatalogRef.Регионы</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_РегионКЛАДР</name>
    <type>
      <types>CatalogRef.абс_Регионы</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ГородКЛАДР</name>
    <type>
      <types>CatalogRef.абс_Города</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_KodKorУТ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_KodKor</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ОсновнойАдресКонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_KodSeti</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>лео_молочники</name>
    <comment>количество &quot;молочников&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>лео_пектиншики</name>
    <comment>количество &quot;пектинщиков&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>лео_ЛППшники</name>
    <comment>количество &quot;ЛППшников&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>лео_молочники_потенциал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>лео_пектиншики_потенциал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>лео_ЛППшники_потенциал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОГРН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_GUID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>46</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ОператорEDI</name>
    <type>
      <types>CatalogRef.Лео_ОператорыЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ВторичныйПокупатель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаКузова</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВысотаПолаКузова</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТемпературныйРежим</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МедицинскаяКнижка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СанитарнаяОбработка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_КаналБюджет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_КлиентEDI</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>лео_ДатаEDI</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>лео_ЦФО</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_СДИЗ</name>
    <comment>сопроводительный документ по идентификации зерна</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛЕО_ОписаниеОсобенностейКонтрагента</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВидыДеятельности</name>
    <comment>(Упр)</comment>
    <attributes>
      <name>ВидДеятельности</name>
      <type>
        <types>CatalogRef.ВидыДеятельностиКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.КонтактныеЛицаКонтрагентов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МенеджерыПокупателя</name>
    <comment>(Упр)</comment>
    <attributes>
      <name>МенеджерПокупателя</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>абс_РучнойВвод</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЦФО</name>
    <attributes>
      <name>ЦФО</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

InformationRegisters/КонтактнаяИнформация/КонтактнаяИнформация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтактнаяИнформация</name>
  <resources>
    <name>Представление</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Поле1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле3</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле4</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле5</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле6</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле7</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле8</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле9</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле10</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ЗначениеПоУмолчанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТипДома</name>
    <type>
      <types>EnumRef.ТипыДомов</types>
    </type>
  </resources>
  <resources>
    <name>ТипКорпуса</name>
    <type>
      <types>EnumRef.ТипыКорпусов</types>
    </type>
  </resources>
  <resources>
    <name>ТипКвартиры</name>
    <type>
      <types>EnumRef.ТипыКвартир</types>
    </type>
  </resources>
  <resources>
    <name>абс_ФайлДопДанных</name>
    <type>
      <types>CatalogRef.ХранилищеДополнительнойИнформации</types>
    </type>
  </resources>
  <resources>
    <name>ТипАдреса</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Значение</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.КонтактныеЛицаКонтрагентов</types>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.ЛичныеКонтакты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вид</name>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>абс_ДатаАктуальностиКИ</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Catalogs/Контрагенты/ObjectModule.bsl
Перем мОснование;

// Обработчик события ПриКопировании
//
Процедура ПриКопировании(ОбъектКопирования)

	Если НЕ ЭтотОбъект.ЭтоГруппа Тогда
		ЭтотОбъект.ОсновнойДоговорКонтрагента = Неопределено;
		ЭтотОбъект.ОсновнойБанковскийСчет     = Неопределено;
		//( + Леовит роман 23.03.15
		ЭтотОбъект.абс_ОсновнойСпособДоставки     = Неопределено;
		//+)
		Если ОбъектКопирования.ГоловнойКонтрагент = ОбъектКопирования.Ссылка Тогда
			ЭтотОбъект.ГоловнойКонтрагент     = Неопределено;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// Функция возвращает результат запроса по справочнику контрагентов с заданным головным контрагентом
//
// Параметры:
//  ГоловнойКонтрагент - заданный головной контрагент
//
// Возвращаемое значение:
//  Результат - результат работы запроса
// 
Функция ПолучитьКонтрагентовПоЗаданномуГоловномуКонтрагенту(ГоловнойКонтрагент) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ГоловнойКонтрагент", ГоловнойКонтрагент);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Контрагент,
	|	Контрагенты.ОбособленноеПодразделение КАК ОбособленноеПодразделение
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ГоловнойКонтрагент = &ГоловнойКонтрагент
	|	И Контрагенты.ГоловнойКонтрагент <> Контрагенты.Ссылка
	|	И НЕ Контрагенты.ПометкаУдаления
	|	И НЕ Контрагенты.ЭтоГруппа
	|
	|УПОРЯДОЧИТЬ ПО
	|	Контрагент";
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат;
	
КонецФункции // ПолучитьКонтрагентовПоЗаданномуГоловномуКонтрагенту()

// Процедура - обработчик события "ОбработкаЗаполнения".
//
Процедура ОбработкаЗаполнения(Основание)

	Если ТипЗнч(Основание) = Тип("СправочникСсылка.Организации") Тогда
		
		Наименование           = Основание.Наименование;
		ЮрФизЛицо              = Основание.ЮрФизЛицо;
		НаименованиеПолное     = Основание.НаименованиеПолное;
		ОсновнойБанковскийСчет = Основание.ОсновнойБанковскийСчет;
		ИНН                    = Основание.ИНН;
		КПП                    = Основание.КПП;
		КодПоОКПО              = Основание.КодПоОКПО;
		мОснование             = Основание;
		Если НЕ Основание.ГоловнаяОрганизация.Пустая() Тогда
			ОбособленноеПодразделение = Истина;	
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры // ОбработкаЗаполнения()

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
	// Проверим основной вид деятельности контрагента
	Если ЗначениеЗаполнено(ОсновнойВидДеятельности) И ВидыДеятельности.Найти(ОсновнойВидДеятельности, "ВидДеятельности") = Неопределено Тогда
		ОсновнойВидДеятельности = Справочники.ВидыДеятельностиКонтрагентов.ПустаяСсылка();
	КонецЕсли;
	
	// установим головного контрагента если он не заполнен
	Если НЕ ЭтоГруппа И НЕ ЗначениеЗаполнено(ГоловнойКонтрагент) И НЕ ОбособленноеПодразделение Тогда
		ГоловнойКонтрагент = Ссылка;
	КонецЕсли;
	
	//АБС ВСТАВКА   18.03.2014 10:53:01  Балашенко
	
	//заполнение основного способа доставки
	Если Не ЭтоГруппа И Не ЭтоНовый() Тогда
		абс_Дистрибуция.ПроверитьОсновныеРеквизитыКонтрагента(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	//АБС ВСТАВКА  КОНЕЦ
	
	//АБС ВСТАВКА   06.05.2014 11:49:07  Балашенко
	Если Не ЭтоГруппа Тогда
		абс_Город 			= ПолучитьБизнесРегионПоУровню(3);
		абс_Территория 		= ПолучитьБизнесРегионПоУровню(2);
		абс_БизнесРегион 	= ПолучитьБизнесРегионПоУровню(1);
		абс_Отдел 			= ПолучитьБизнесРегионПоУровню(0);
	КонецЕсли;
	//АБС ВСТАВКА  КОНЕЦ
	
	//АБС ВСТАВКА   15.06.2014 21:08:57  Фролов
	Если Не ЭтоГруппа Тогда
		абс_ЗаполнитьМенеджеровПоБизнесРегиону();
	КонецЕсли;
	//АБС ВСТАВКА  КОНЕЦ 
	
	//АБС ВСТАВКА 18.06.2014 Фролов
	Если НЕ ЭтоГруппа Тогда
		абс_ЗаполнитьОсновнойАдресКонтрагента();
	КонецЕсли;
	//АБС ВСТАВКА  КОНЕЦ  
	
	#Если Клиент Тогда  
		Если (ЗначениеЗаполнено(ИНН) и НеЯвляетсяРезидентом) ИЛИ (НЕ ЗначениеЗаполнено(ИНН) и НЕ НеЯвляетсяРезидентом) Тогда
			Предупреждение("Не корректное заполнение Контрагента, небходимо либо заполнить ИНН контрагента, либо установить галочку НЕ РЕЗИДЕНТ",20);
			Отказ	=	Истина;
		КонецЕсли;
	#КонецЕсли
КонецПроцедуры

//АБС ВСТАВКА   06.05.2014 11:49:07  Балашенко
Функция ПолучитьБизнесРегионПоУровню(Уровень) Экспорт
	
	Если Регион.Пустая() Тогда
		Возврат Справочники.Регионы.ПустаяСсылка();
	КонецЕсли;
	ТекущийУровень = Регион.Уровень();
	Если ТекущийУровень<Уровень Тогда
		Возврат Справочники.Регионы.ПустаяСсылка();
	КонецЕсли;
	БизнесРегион = Регион;
	Сч = ТекущийУровень - Уровень;
	Пока Сч>0 Цикл
		БизнесРегион = БизнесРегион.Родитель;
		Сч = Сч - 1;
	КонецЦикла;
	
	Возврат БизнесРегион;
	
КонецФункции
//АБС ВСТАВКА  КОНЕЦ

//АБС ВСТАВКА   15.06.2014 21:01:22  Фролов
Процедура абс_ЗаполнитьМенеджеровПоБизнесРегиону() Экспорт
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("абс_РучнойВвод", Ложь);
	
	МассивСтрок = ЭтотОбъект.МенеджерыПокупателя.НайтиСтроки(СтруктураОтбора);
	
	Для Каждого СтрокаТЧ Из МассивСтрок Цикл
		ЭтотОбъект.МенеджерыПокупателя.Удалить(СтрокаТЧ);
	КонецЦикла;
	
	//ЭтотОбъект.МенеджерыПокупателя.Очистить();
	
	ЭтотОбъект.МенеджерыПокупателя.Добавить().МенеджерПокупателя = ЭтотОбъект.абс_БизнесРегион.абс_Менеджер;
	
	ЭтотОбъект.ОсновнойМенеджерПокупателя = ЭтотОбъект.абс_БизнесРегион.абс_Менеджер;
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		
		НаборСвойства = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей();
		
		НаборСвойства.Отбор.Объект.Установить(Ссылка);
		НаборСвойства.Отбор.Свойство.Установить(ПланыВидовХарактеристик.СвойстваОбъектов.абс_ВторойМенеджер);
		
		НаборСвойства.Прочитать();
		
		НаборСвойства.Очистить();
		
		ЗаписьСвойство = НаборСвойства.Добавить();
		
		ЗаписьСвойство.Объект 			= Ссылка;
		ЗаписьСвойство.Свойство         = ПланыВидовХарактеристик.СвойстваОбъектов.абс_ВторойМенеджер;
		ЗаписьСвойство.Значение			= ЭтотОбъект.абс_Территория.абс_Менеджер;
		
		НаборСвойства.Записать();
		
	КонецЕсли;
	
КонецПроцедуры
//АБС ВСТАВКА  КОНЕЦ 

//АБС ВСТАВКА 18.06.2014 Фролов
Процедура абс_ЗаполнитьОсновнойАдресКонтрагента() Экспорт
	
	Если ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Представление КАК абс_ОсновнойАдресКонтрагента
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Объект
	|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|	И КонтактнаяИнформация.ЗначениеПоУмолчанию");
	
	Запрос.УстановитьПараметр("Объект", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		абс_ОсновнойАдресКонтрагента = Выборка.абс_ОсновнойАдресКонтрагента;
		
	КонецЕсли;	
	
КонецПроцедуры
//АБС ВСТАВКА КОНЕЦ

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ГоловнойКонтрагент) И ГоловнойКонтрагент <> Ссылка Тогда
		
		Если ЗначениеЗаполнено(ГоловнойКонтрагент.ГоловнойКонтрагент) И ГоловнойКонтрагент.ГоловнойКонтрагент <> ГоловнойКонтрагент Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Контрагент "+СокрЛП(ГоловнойКонтрагент)+" не может быть выбран головным, 
							|так как для него уже был назначен головной контрагент "+СокрЛП(ГоловнойКонтрагент.ГоловнойКонтрагент)+"!");
			Отказ = Истина;
			Возврат;
		Иначе
			
			// надо проверить, что если указываем головного контрагента, то этот элемент уже не был установлен
			// в качестве головного у другого контрагента.
			ВыборкаПоГоловномуКонтрагенту = ПолучитьКонтрагентовПоЗаданномуГоловномуКонтрагенту(Ссылка).Выбрать();
			Если ВыборкаПоГоловномуКонтрагенту.Количество() <> 0 Тогда
				
				СообщениеОНевозможностиЗаписи = "Контрагент "+СокрЛП(ЭтотОбъект)+" не может иметь головного контрагента!
												|Этот контрагент уже установлен головным для: ";
				Пока ВыборкаПоГоловномуКонтрагенту.Следующий() Цикл
					СообщениеОНевозможностиЗаписи = СообщениеОНевозможностиЗаписи + Символы.ПС + СокрЛП(ВыборкаПоГоловномуКонтрагенту.Контрагент);
				КонецЦикла;
				
				ОбщегоНазначения.СообщитьОбОшибке(СообщениеОНевозможностиЗаписи);
				Отказ = Истина;
				Возврат;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// проверим, что контрагент - физ. лицо уже не был установлен головным контрагентом для обособленных подразделений
	Если НЕ ЭтоНовый() И ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
		
		ЕстьОбособленныеПодразделения = Ложь;
		СообщениеОНевозможностиЗаписи = "Контрагент " + СокрЛП(ЭтотОбъект) + " не может быть физическим лицом!
			|Этот контрагент уже установлен головным для: ";
			
		ВыборкаПоГоловномуКонтрагенту = ПолучитьКонтрагентовПоЗаданномуГоловномуКонтрагенту(Ссылка).Выбрать();			
		Если ВыборкаПоГоловномуКонтрагенту.Количество() <> 0 Тогда
			Пока ВыборкаПоГоловномуКонтрагенту.Следующий() Цикл
				Если ВыборкаПоГоловномуКонтрагенту.ОбособленноеПодразделение Тогда
					ЕстьОбособленныеПодразделения = Истина;
					СообщениеОНевозможностиЗаписи = СообщениеОНевозможностиЗаписи + Символы.ПС + СокрЛП(ВыборкаПоГоловномуКонтрагенту.Контрагент);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;	
		
		Если ЕстьОбособленныеПодразделения Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СообщениеОНевозможностиЗаписи, Отказ);
			Возврат;
		КонецЕсли;
		
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(мОснование) Тогда
		НаборЗаписей = РегистрыСведений.СобственныеКонтрагенты.СоздатьНаборЗаписей();
		ЗаписьРегистра = НаборЗаписей.Добавить();
		ЗаписьРегистра.Контрагент = Ссылка;
		ЗаписьРегистра.ВидСвязи   = Перечисления.ВидыСобственныхКонтрагентов.Организация;
		ЗаписьРегистра.Объект     = мОснование;
		НаборЗаписей.Записать(Ложь);
		мОснование = "";
	КонецЕсли;
	
	// при изменении ИНН перепишем ИНН у обособленных подразделений контрагента
	Если НЕ ЭтоНовый() И НЕ ОбособленноеПодразделение И ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
		
		ВыборкаПоГоловномуКонтрагенту = ПолучитьКонтрагентовПоЗаданномуГоловномуКонтрагенту(Ссылка).Выбрать();
		Если ВыборкаПоГоловномуКонтрагенту.Количество() <> 0 Тогда
			
			Пока ВыборкаПоГоловномуКонтрагенту.Следующий() Цикл
				
				Если ИНН = ВыборкаПоГоловномуКонтрагенту.Контрагент.ИНН
					ИЛИ НЕ ВыборкаПоГоловномуКонтрагенту.ОбособленноеПодразделение Тогда
					Продолжить;
				КонецЕсли;
				
				КонтрагентДляИзменения = ВыборкаПоГоловномуКонтрагенту.Контрагент.ПолучитьОбъект();
				КонтрагентДляИзменения.ИНН = ИНН;
				Попытка
					КонтрагентДляИзменения.Записать();
				Исключение
					ОписаниеОшибки = "Ошибка при записи обособленных подразделений контрагента.
					|Не удалось изменить ИНН у обособленного подразделения " + КонтрагентДляИзменения.Наименование;
					ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки);
				КонецПопытки;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
